# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOE-v8 object detection model with P3/8 - P5/32 outputs
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yoloe-v8n.yaml' will call yoloe-v8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOE-v8n summary: 148 layers, 3695183 parameters, 3695167 gradients, 19.5 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOE-v8s summary: 148 layers, 12759880 parameters, 12759864 gradients, 51.0 GFLOPs
  m: [0.67, 0.75, 768] # YOLOE-v8m summary: 188 layers, 28376158 parameters, 28376142 gradients, 110.5 GFLOPs
  l: [1.00, 1.00, 512] # YOLOE-v8l summary: 228 layers, 46832050 parameters, 46832034 gradients, 204.5 GFLOPs
  x: [1.00, 1.25, 512] # YOLOE-v8x summary: 228 layers, 72886377 parameters, 72886361 gradients, 309.3 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f_Heat, [256]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f_Heat, [512]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f_Heat, [1024]] # 8

# YOLOv8.0n head
head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 9 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 10
  - [-1, 1, Conv, [256, 1, 1]] # 11, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13 input_proj.1
  - [4, 1, ADown, [256]] # 14
  - [[-3, -2, -1], 1, Concat, [1]] # 15
  - [-1, 1, DWConv, [768, 5, 1, 1, False]] # 16
  - [-2, 1, DWConv, [768, 7, 1, 1, False]] # 17
  - [-3, 1, DWConv, [768, 9, 1, 1, False]] # 18
  - [-4, 1, DWConv, [768, 11, 1, 1, False]] # 19
  - [[-5, -4, -3, -2, -1], 1, Add, []] # 20
  - [-1, 1, Conv, [768, 1, 1, None, 1, 1, False]] # 21 Fusion
  - [[-7, -1], 1, Add, []] # 22
  - [-1, 1, ChunkSelect, [3, 0, 1]] # 23
  - [-2, 1, ChunkSelect, [3, 1, 1]] # 24
  - [-3, 1, ChunkSelect, [3, 2, 1]] # 25

  - [23, 1, nn.Upsample, [None, 2, "nearest"]] # 26

  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 27 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # 28 cat backbone P4
  - [-1, 1, eSE_Fusion, [512, 2, 1]] # 29
  - [-1, 3, RepC3, [256]] # X3 (30), fpn_blocks.1
  - [-1, 1, Conv, [256, 1, 1]] # 31, Y4, lateral_convs.1

  - [25, 1, ADown, [256]] # 32

  - [8, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 33 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # 34 cat backbone P4
  - [-1, 1, eSE_Fusion, [512, 2, 1]] # 35
  - [-1, 3, RepC3, [256]] # X3 (36), fpn_blocks.1
  - [-1, 1, Conv, [256, 1, 1]] # 37, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 38
  - [24, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 39 input_proj.1
  - [31, 1, ADown, [256]] # 40
  - [[-3, -2, -1], 1, Concat, [1]] # 41
  - [-1, 1, DWConv, [768, 5, 1, 1, False]] # 42
  - [-2, 1, DWConv, [768, 7, 1, 1, False]] # 43
  - [-3, 1, DWConv, [768, 9, 1, 1, False]] # 44
  - [-4, 1, DWConv, [768, 11, 1, 1, False]] # 45
  - [[-5, -4, -3, -2, -1], 1, Add, []] # 46
  - [-1, 1, Conv, [768, 1, 1, None, 1, 1, False]] # 47 Fusion
  - [[-7, -1], 1, Add, []] # 48
  - [-1, 1, ChunkSelect, [3, 0, 1]] # 49
  - [-2, 1, ChunkSelect, [3, 1, 1]] # 50
  - [-3, 1, ChunkSelect, [3, 2, 1]] # 51

  - [49, 1, nn.Upsample, [None, 2, "nearest"]] # 52
  - [[26, 31, -1], 1, Concat, [1]] # 53 cat backbone P4
  - [-1, 1, eSE_Fusion, [768, 3, 1]] # 54
  - [-1, 3, RepC3, [256]] # X3 (55), fpn_blocks.1

  - [51, 1, ADown, [256]] # 56
  - [[32, 37, -1], 1, Concat, [1]] # 57 cat backbone P4
  - [-1, 1, eSE_Fusion, [768, 3, 1]] # 58
  - [-1, 3, RepC3, [256]] # X3 (59), fpn_blocks.1

  - [[55, 50, 59], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
